In [1]:
import numpy as np
import pandas as pd

In [2]:
movies=pd.read_csv('tmdb_5000_movies.csv')
credits=pd.read_csv('tmdb_5000_credits.csv')

In [3]:
movies.head(1)

,budget,genres,homepage,id,keywords,original_language,original_title,overview,popularity,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,vote_average,vote_count
0,237000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.avatarmovie.com/,19995,"[{""id"": 1463, ""name"": ""culture clash""}, {""id"":...",en,Avatar,"In the 22nd century, a paraplegic Marine is di...",150.437577,"[{""name"": ""Ingenious Film Partners"", ""id"": 289...","[{""iso_3166_1"": ""US"", ""name"": ""United States o...",2009-12-10,2787965087,162.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}, {""iso...",Released,Enter the World of Pandora.,Avatar,7.2,11800

In [4]:
credits.head(1)

,movie_id,title,cast,crew
0,19995,Avatar,"[{""cast_id"": 242, ""character"": ""Jake Sully"", ""...","[{""credit_id"": ""52fe48009251416c750aca23"", ""de..."

In [5]:
movies.shape

(4803, 20)

In [6]:
credits.shape

(4803, 4)

In [7]:
movies=movies.merge(credits,on='title')

In [8]:
movies.shape

(4809, 23)

## here movies have 20 columns and credits have 4 columns 
## by merging these both on title column we get 23 columns in total
we do merging by-----------movies.merge(credits,on='title')

In [9]:
movies.head(1)

,budget,genres,homepage,id,keywords,original_language,original_title,overview,popularity,production_companies,...,runtime,spoken_languages,status,tagline,title,vote_average,vote_count,movie_id,cast,crew
0,237000000,"[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...",http://www.avatarmovie.com/,19995,"[{""id"": 1463, ""name"": ""culture clash""}, {""id"":...",en,Avatar,"In the 22nd century, a paraplegic Marine is di...",150.437577,"[{""name"": ""Ingenious Film Partners"", ""id"": 289...",...,162.0,"[{""iso_639_1"": ""en"", ""name"": ""English""}, {""iso...",Released,Enter the World of Pandora.,Avatar,7.2,11800,19995,"[{""cast_id"": 242, ""character"": ""Jake Sully"", ""...","[{""credit_id"": ""52fe48009251416c750aca23"", ""de..."

In [10]:
##THE COLUMNS WE ARE CONSIDERING FOR OUR PROJECT ARE THESE GIVEN BELOW
#👇👇
#genre
#id
#keywords
#title
#overview
#cast
#crew
movies.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4809 entries, 0 to 4808
Data columns (total 23 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   budget                4809 non-null   int64
 1   genres                4809 non-null   object
 2   homepage              1713 non-null   object
 3   id                    4809 non-null   int64
 4   keywords              4809 non-null   object
 5   original_language     4809 non-null   object
 6   original_title        4809 non-null   object
 7   overview              4806 non-null   object
 8   popularity            4809 non-null   float64
 9   production_companies  4809 non-null   object
 10  production_countries  4809 non-null   object
 11  release_date          4808 non-null   object
 12  revenue               4809 non-null   int64
 13  runtime               4807 non-null   float64
 14  spoken_languages      4809 non-null   object
 15  status                4809 non-null   object
 16  tagline               3965 non-null   object
 17  title                 4809 non-null   object
 18  vote_average          4809 non-null   float64
 19  vote_count            4809 non-null   int64
 20  movie_id              4809 non-null   int64
 21  cast                  4809 non-null   object
 22  crew                  4809 non-null   object
dtypes: float64(3), int64(5), object(15)
memory usage: 901.7+ KB

In [11]:
movies=movies[['movie_id','title','overview','genres','keywords','cast','crew']]

In [12]:
movies.head(1)

,movie_id,title,overview,genres,keywords,cast,crew
0,19995,Avatar,"In the 22nd century, a paraplegic Marine is di...","[{""id"": 28, ""name"": ""Action""}, {""id"": 12, ""nam...","[{""id"": 1463, ""name"": ""culture clash""}, {""id"":...","[{""cast_id"": 242, ""character"": ""Jake Sully"", ""...","[{""credit_id"": ""52fe48009251416c750aca23"", ""de..."

## Now we are planning on to have three columns ->movie_id  ->title  ->tags
## tags is formed by combining-->overview ,genres ,keyword ,cast(top three actors of the movie),crew(only directors name in crew)

->How we will merge these four columns is by taking overview and adding all genres's keyword in it at last of it. 
->Again after that in overview and genres's end we will add keywords's words at the end of this previously combined two columns
->Again in cast we will add only top three actors/cast of the movie and we will add it to previously combined columns
->In crew we will add only the directors name to this,same again previously combined columns
->AT THE END OF THIS we will get a paragraph at the end 
->Such paragraphs for every movie is formed

->BEFORE GETTING THIS PARAGRAPH FOR EVERY MOVIE WE NEED TO DO
  PREPROCESSING:
  STEP1:SINCE IT IS IN DIFF FORMAT WE NEED TO DO PREPROCESSING BY CONVERTING THEM INTO PROPER FORMAT
  STEP2:REMOVE MISSING DATA,REMOVE DUPLICATE DATA

##for MISSING DATA
In Python, the 👉 .dropna() function is used to remove missing or NaN (Not-a-Number) values from a DataFrame or Series in libraries
like pandas. It is commonly used for data cleaning to eliminate rows or columns with missing data, which can help in 
data analysis and processing.

The 👉 .isnull().sum() function in Python, typically used with pandas DataFrames or Series, is used to count the number of missing (NaN) values in each column. It works by first applying the .isnull() function to identify missing values (resulting in a DataFrame or Series of boolean values), and then using .sum() to count the True values, which correspond to missing data, in each column. This is a useful step in data preprocessing to understand the extent of missing data in a dataset.

In [13]:
##it runned after removing null and putting true for isnull that's why before--- overview  3 after running----- overview  0
movies.isnull().sum()

movie_id    0
title       0
overview    3
genres      0
keywords    0
cast        0
crew        0
dtype: int64

By default, dropna() does not modify the original DataFrame but instead returns a new DataFrame with the rows or columns containing NaN values removed.

When you set inplace=True, you are telling the method to perform the operation on the original DataFrame (in this case, "movies") and make the changes directly within it, without returning a new DataFrame. This can be more memory-efficient and is useful when you want to update the existing DataFrame.👇👇

In [14]:
movies.dropna(inplace=True)
## Now run the above isnull().sum() again for checking/ensuring that there no null values

In [15]:
## .duplicated().sum() is used to know if any row is repeated again in the next row
movies.duplicated().sum()

0

In [16]:
## to convert genres in different format to normal format i.e FROM DICTIONARY TO LIST 
movies.iloc[0].genres

'[{"id": 28, "name": "Action"}, {"id": 12, "name": "Adventure"}, {"id": 14, "name": "Fantasy"}, {"id": 878, "name": "Science Fiction"}]'

In [17]:
##before entering this function it is in dictionary format after this function it will be in list format
##with using ast module in python in that we have litearl_eval function which converts string in present dictionaryto normallist

import ast
def convert(obj):
    L=[]
    for i in ast.literal_eval(obj):
        L.append(i['name'])
    return L

👇👇checking the convert function

In [18]:
convert('[{"id": 28, "name": "Action"}, {"id": 12, "name": "Adventure"}, {"id": 14, "name": "Fantasy"}, {"id": 878, "name": "Science Fiction"}]')

['Action', 'Adventure', 'Fantasy', 'Science Fiction']

applying the convert function on all of the genres using   .apply(func_name)

In [19]:
movies['genres']=movies['genres'].apply(convert)

In [20]:
movies.head(1)

,movie_id,title,overview,genres,keywords,cast,crew
0,19995,Avatar,"In the 22nd century, a paraplegic Marine is di...","[Action, Adventure, Fantasy, Science Fiction]","[{""id"": 1463, ""name"": ""culture clash""}, {""id"":...","[{""cast_id"": 242, ""character"": ""Jake Sully"", ""...","[{""credit_id"": ""52fe48009251416c750aca23"", ""de..."

## .apply(convert) is to apply convert function for a whole column 
## Syntax: dt_name[column_name].apply(function)

## apply same .apply(convert) for the keywords too

In [21]:
movies['keywords']=movies['keywords'].apply(convert)

In [22]:
movies.iloc[2].keywords

['spy',
 'based on novel',
 'secret agent',
 'sequel',
 'mi6',
 'british secret service',
 'united kingdom']

In [23]:
import ast
def convert3(obj):
    L=[]
    counter=0
    for i in ast.literal_eval(obj):
        if counter!=3:
            L.append(i['name'])
            counter+=1
        else:
            break
    return L

In [24]:
movies['cast']=movies['cast'].apply(convert3)

👆👆
## here we took convert3 function it an updated version of convert function since we need only 3 actors name we took a count variable and set it to upto 0,1,2 indexes so that we will have three actors name only cause i want to consider three actors for a movie

In [25]:
movies.head(1)

,movie_id,title,overview,genres,keywords,cast,crew
0,19995,Avatar,"In the 22nd century, a paraplegic Marine is di...","[Action, Adventure, Fantasy, Science Fiction]","[culture clash, future, space war, space colon...","[Sam Worthington, Zoe Saldana, Sigourney Weaver]","[{""credit_id"": ""52fe48009251416c750aca23"", ""de..."

In [26]:
movies.iloc[4000].crew

'[{"credit_id": "52fe46879251416c7507b3bf", "department": "Art", "gender": 2, "id": 5188, "job": "Art Direction", "name": "Hal Pereira"}, {"credit_id": "52fe46879251416c7507b36f", "department": "Directing", "gender": 0, "id": 8500, "job": "Director", "name": "John Ford"}, {"credit_id": "52fe46879251416c7507b38d", "department": "Production", "gender": 0, "id": 8500, "job": "Producer", "name": "John Ford"}, {"credit_id": "52fe46879251416c7507b393", "department": "Sound", "gender": 2, "id": 14647, "job": "Original Music Composer", "name": "Cyril J. Mockridge"}, {"credit_id": "52fe46879251416c7507b39f", "department": "Editing", "gender": 2, "id": 14961, "job": "Editor", "name": "Otho Lovering"}, {"credit_id": "52fe46879251416c7507b381", "department": "Writing", "gender": 2, "id": 30491, "job": "Screenplay", "name": "Frank S. Nugent"}, {"credit_id": "52fe46879251416c7507b399", "department": "Camera", "gender": 2, "id": 40183, "job": "Director of Photography", "name": "William H. Clothier"}, {"credit_id": "52fe46879251416c7507b387", "department": "Writing", "gender": 2, "id": 50302, "job": "Screenplay", "name": "James Edward Grant"}, {"credit_id": "52fe46879251416c7507b375", "department": "Writing", "gender": 0, "id": 105568, "job": "Story", "name": "Edmund Beloin"}, {"credit_id": "52fe46879251416c7507b3b9", "department": "Art", "gender": 0, "id": 116723, "job": "Art Direction", "name": "Eddie Imazu"}]'

## here we have many dictionaries we need only one dictionary in which job = is director and 
## we need to extract name of that

we need to iterate through all dictionaries and check if job==director   if:yes   then extract name.

In [27]:
import ast
def fetch_director(obj):
    L=[]
    for i in ast.literal_eval(obj):
        if i['job']=='Director':
            L.append(i['name'])
    return L

In [28]:
fetch_director('[{"credit_id": "52fe46879251416c7507b3bf", "department": "Art", "gender": 2, "id": 5188, "job": "Art Direction", "name": "Hal Pereira"}, {"credit_id": "52fe46879251416c7507b36f", "department": "Directing", "gender": 0, "id": 8500, "job": "Director", "name": "John Ford"}, {"credit_id": "52fe46879251416c7507b38d", "department": "Production", "gender": 0, "id": 8500, "job": "Producer", "name": "John Ford"}, {"credit_id": "52fe46879251416c7507b393", "department": "Sound", "gender": 2, "id": 14647, "job": "Original Music Composer", "name": "Cyril J. Mockridge"}, {"credit_id": "52fe46879251416c7507b39f", "department": "Editing", "gender": 2, "id": 14961, "job": "Editor", "name": "Otho Lovering"}, {"credit_id": "52fe46879251416c7507b381", "department": "Writing", "gender": 2, "id": 30491, "job": "Screenplay", "name": "Frank S. Nugent"}, {"credit_id": "52fe46879251416c7507b399", "department": "Camera", "gender": 2, "id": 40183, "job": "Director of Photography", "name": "William H. Clothier"}, {"credit_id": "52fe46879251416c7507b387", "department": "Writing", "gender": 2, "id": 50302, "job": "Screenplay", "name": "James Edward Grant"}, {"credit_id": "52fe46879251416c7507b375", "department": "Writing", "gender": 0, "id": 105568, "job": "Story", "name": "Edmund Beloin"}, {"credit_id": "52fe46879251416c7507b3b9", "department": "Art", "gender": 0, "id": 116723, "job": "Art Direction", "name": "Eddie Imazu"}]')

['John Ford']

In [29]:
movies['crew']=movies['crew'].apply(fetch_director)

In [30]:
movies.head(3)

,movie_id,title,overview,genres,keywords,cast,crew
0,19995,Avatar,"In the 22nd century, a paraplegic Marine is di...","[Action, Adventure, Fantasy, Science Fiction]","[culture clash, future, space war, space colon...","[Sam Worthington, Zoe Saldana, Sigourney Weaver]",[James Cameron]
1,285,Pirates of the Caribbean: At World's End,"Captain Barbossa, long believed to be dead, ha...","[Adventure, Fantasy, Action]","[ocean, drug abuse, exotic island, east india ...","[Johnny Depp, Orlando Bloom, Keira Knightley]",[Gore Verbinski]
2,206647,Spectre,A cryptic message from Bond’s past sends him o...,"[Action, Adventure, Crime]","[spy, based on novel, secret agent, sequel, mi...","[Daniel Craig, Christoph Waltz, Léa Seydoux]",[Sam Mendes]

In [31]:
##now the leftover one is converting "overview" as list since it is in 'string', to concatenate it with genres,keyword,cast,..
##,...crew (which are in 'list' ) we need to convert overview---to list as well

In [32]:
## we can split string to list by using function------------>.apply(lambda x:x.split())
movies['overview']=movies['overview'].apply(lambda x:x.split())

In [33]:
movies.head(1)

,movie_id,title,overview,genres,keywords,cast,crew
0,19995,Avatar,"[In, the, 22nd, century,, a, paraplegic, Marin...","[Action, Adventure, Fantasy, Science Fiction]","[culture clash, future, space war, space colon...","[Sam Worthington, Zoe Saldana, Sigourney Weaver]",[James Cameron]

In [34]:
movies.iloc[0]

movie_id                                                19995
title                                                  Avatar
overview    [In, the, 22nd, century,, a, paraplegic, Marin...
genres          [Action, Adventure, Fantasy, Science Fiction]
keywords    [culture clash, future, space war, space colon...
cast         [Sam Worthington, Zoe Saldana, Sigourney Weaver]
crew                                          [James Cameron]
Name: 0, dtype: object

In [35]:
movies.iloc[34]

movie_id                                                62211
title                                     Monsters University
overview    [A, look, at, the, relationship, between, Mike...
genres                                    [Animation, Family]
keywords    [monster, dormitory, games, animation, best fr...
cast             [Billy Crystal, John Goodman, Steve Buscemi]
crew                                            [Dan Scanlon]
Name: 34, dtype: object

In [36]:
movies.head(1)

,movie_id,title,overview,genres,keywords,cast,crew
0,19995,Avatar,"[In, the, 22nd, century,, a, paraplegic, Marin...","[Action, Adventure, Fantasy, Science Fiction]","[culture clash, future, space war, space colon...","[Sam Worthington, Zoe Saldana, Sigourney Weaver]",[James Cameron]

## now we have changed everything into list to concatenate as tags
## But we have 1.more problem to deal with that is:
## in  all these names in every column if "sam worthington" is present it takes "sam" and          "worthington" as two entities and let's say sam mendes is there if i enter sam worthington acted movies it would show me movies directed by sam mendes--to solve this we will remove space between two words by using replace function and iterating it through every element in all lists using a loop

In [37]:
##****************IMPORT FUNCTION ALERT********************************##
movies['genres']=movies['genres'].apply(lambda x:[i.replace(" ","") for i in x])
movies['cast']=movies['cast'].apply(lambda x:[i.replace(" ","") for i in x])
movies['crew']=movies['crew'].apply(lambda x:[i.replace(" ","") for i in x])
movies['keywords']=movies['keywords'].apply(lambda x:[i.replace(" ","") for i in x])

In [38]:
movies.head(1)

,movie_id,title,overview,genres,keywords,cast,crew
0,19995,Avatar,"[In, the, 22nd, century,, a, paraplegic, Marin...","[Action, Adventure, Fantasy, ScienceFiction]","[cultureclash, future, spacewar, spacecolony, ...","[SamWorthington, ZoeSaldana, SigourneyWeaver]",[JamesCameron]

## now we need to create new column name tags and in that we would add/concatenate 'overview' + 'genres' + 'keywors' + 'cast' + 'crew'

In [39]:
movies['tags']=movies['overview']+movies['genres']+movies['keywords']+movies['cast']+movies['crew']

In [40]:
movies.head(1)

,movie_id,title,overview,genres,keywords,cast,crew,tags
0,19995,Avatar,"[In, the, 22nd, century,, a, paraplegic, Marin...","[Action, Adventure, Fantasy, ScienceFiction]","[cultureclash, future, spacewar, spacecolony, ...","[SamWorthington, ZoeSaldana, SigourneyWeaver]",[JamesCameron],"[In, the, 22nd, century,, a, paraplegic, Marin..."

In [41]:
new_df=movies[['movie_id','title','tags']]

## 👆👆here we created a new dataframe since we need only movie_id,title,tags--->columns we added that in a new dataframe created by us

In [42]:
new_df.head(2)

,movie_id,title,tags
0,19995,Avatar,"[In, the, 22nd, century,, a, paraplegic, Marin..."
1,285,Pirates of the Caribbean: At World's End,"[Captain, Barbossa,, long, believed, to, be, d..."

In [43]:
new_df

,movie_id,title,tags
0,19995,Avatar,"[In, the, 22nd, century,, a, paraplegic, Marin..."
1,285,Pirates of the Caribbean: At World's End,"[Captain, Barbossa,, long, believed, to, be, d..."
2,206647,Spectre,"[A, cryptic, message, from, Bond’s, past, send..."
3,49026,The Dark Knight Rises,"[Following, the, death, of, District, Attorney..."
4,49529,John Carter,"[John, Carter, is, a, war-weary,, former, mili..."
...,...,...,...
4804,9367,El Mariachi,"[El, Mariachi, just, wants, to, play, his, gui..."
4805,72766,Newlyweds,"[A, newlywed, couple's, honeymoon, is, upended..."
4806,231617,"Signed, Sealed, Delivered","[""Signed,, Sealed,, Delivered"", introduces, a,..."
4807,126186,Shanghai Calling,"[When, ambitious, New, York, attorney, Sam, is..."
4808,25975,My Date with Drew,"[Ever, since, the, second, grade, when, he, fi..."

In [44]:
new_df['title'][4804]

'El Mariachi'

In [45]:
new_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4806 entries, 0 to 4808
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   movie_id  4806 non-null   int64
 1   title     4806 non-null   object
 2   tags      4806 non-null   object
dtypes: int64(1), object(2)
memory usage: 279.2+ KB

## Now for converting this 'tags' which is in list to string we need to use 
## .apply(lambda x:" ".join(x))

In [46]:
new_df['tags']=new_df['tags'].apply(lambda x:" ".join(x))

C:\Users\K.E.Shravya\AppData\Local\Temp\ipykernel_32804\487797088.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df['tags']=new_df['tags'].apply(lambda x:" ".join(x))

In [47]:
new_df.iloc[0].tags

'In the 22nd century, a paraplegic Marine is dispatched to the moon Pandora on a unique mission, but becomes torn between following orders and protecting an alien civilization. Action Adventure Fantasy ScienceFiction cultureclash future spacewar spacecolony society spacetravel futuristic romance space alien tribe alienplanet cgi marine soldier battle loveaffair antiwar powerrelations mindandsoul 3d SamWorthington ZoeSaldana SigourneyWeaver JamesCameron'

In [48]:
new_df['tags']=new_df['tags'].apply(lambda x:x.lower())

C:\Users\K.E.Shravya\AppData\Local\Temp\ipykernel_32804\4224080999.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df['tags']=new_df['tags'].apply(lambda x:x.lower())

In [49]:
new_df['tags'][1]

"captain barbossa, long believed to be dead, has come back to life and is headed to the edge of the earth with will turner and elizabeth swann. but nothing is quite as it seems. adventure fantasy action ocean drugabuse exoticisland eastindiatradingcompany loveofone'slife traitor shipwreck strongwoman ship alliance calypso afterlife fighter pirate swashbuckler aftercreditsstinger johnnydepp orlandobloom keiraknightley goreverbinski"

In [50]:
new_df

,movie_id,title,tags
0,19995,Avatar,"in the 22nd century, a paraplegic marine is di..."
1,285,Pirates of the Caribbean: At World's End,"captain barbossa, long believed to be dead, ha..."
2,206647,Spectre,a cryptic message from bond’s past sends him o...
3,49026,The Dark Knight Rises,following the death of district attorney harve...
4,49529,John Carter,"john carter is a war-weary, former military ca..."
...,...,...,...
4804,9367,El Mariachi,el mariachi just wants to play his guitar and ...
4805,72766,Newlyweds,a newlywed couple's honeymoon is upended by th...
4806,231617,"Signed, Sealed, Delivered","""signed, sealed, delivered"" introduces a dedic..."
4807,126186,Shanghai Calling,when ambitious new york attorney sam is sent t...
4808,25975,My Date with Drew,ever since the second grade when he first saw ...

## 👇👇Now here we are performing Stemming Using natural language toolkit library
## i.e lets's say if we have dance,dancing,danced----> instead of all these it would show/print 
## danc,danc,danc which is the keyword
## And while taking the most used words among them instead of taking dance,dancing,danced it would take only one keyword as danc

In [51]:
import nltk

In [52]:
from nltk.stem.porter import PorterStemmer
ps=PorterStemmer()

In [53]:
def stem(text):
    y=[]
    for i in text.split():
        y.append(ps.stem(i))
    return " ".join(y)

In [54]:
new_df['tags']=new_df['tags'].apply(stem)

C:\Users\K.E.Shravya\AppData\Local\Temp\ipykernel_32804\3514595201.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df['tags']=new_df['tags'].apply(stem)

## 1.preprocessing the data----->part has been completed
## Now----->2.creating the model-----part

## FOR 2.CREATING THE MODEL
## Now one of the method for finding similar movie is to find number of  similar words and the ones which have more similar words are resulted in the suggestions----->This method is the basic way of finding similar suggestion which might not be very effective
## But the method we are going to use is----->vectorization method<-----

In [55]:
new_df.iloc[0].tags

'in the 22nd century, a parapleg marin is dispatch to the moon pandora on a uniqu mission, but becom torn between follow order and protect an alien civilization. action adventur fantasi sciencefict cultureclash futur spacewar spacecoloni societi spacetravel futurist romanc space alien tribe alienplanet cgi marin soldier battl loveaffair antiwar powerrel mindandsoul 3d samworthington zoesaldana sigourneyweav jamescameron'

## Text vectorization method
converts text--->vectors
each movie is represented as a vector and vector which is closest to a particular vector is the one similar movie

## The process/main idea is
To take most used words lets say we will take 5000 words here
->And for every movie we take that movie's particular tag and we write if our taken word is present in that 5000 words
->In this way we will make a table out of it in this way
   w1 |w2 |w3 |w4 |w4 |w5 |w6......
m1 5   0    1   0  0   ............
m2 1   0    3   1  1   ............
.
.
.



->Now we will plot these vectors of each movie and it would be of a dimension (4806,5000)
->We can do all these manually but the good and efficient thing is we have libraries for this implementation
->We can use scikit-learn library for this in that we will use CountVectorizer module

In [56]:
new_df.tags[0]

'in the 22nd century, a parapleg marin is dispatch to the moon pandora on a uniqu mission, but becom torn between follow order and protect an alien civilization. action adventur fantasi sciencefict cultureclash futur spacewar spacecoloni societi spacetravel futurist romanc space alien tribe alienplanet cgi marin soldier battl loveaffair antiwar powerrel mindandsoul 3d samworthington zoesaldana sigourneyweav jamescameron'

In [57]:
new_df.tags[1]

"captain barbossa, long believ to be dead, ha come back to life and is head to the edg of the earth with will turner and elizabeth swann. but noth is quit as it seems. adventur fantasi action ocean drugabus exoticisland eastindiatradingcompani loveofone'slif traitor shipwreck strongwoman ship allianc calypso afterlif fighter pirat swashbuckl aftercreditssting johnnydepp orlandobloom keiraknightley goreverbinski"

## here we are using CountVectorizer from sklearn.feature_extraction.text
## And make an object using CountVectorizer class
## In this CountVectorizer we can specify few characters like max_features==no of words considering=5000(here) and stop words like in english is,are,the,for....... which are used for sentence formation which has no actual meaning in the sentence stop_words='english'

In [58]:
from sklearn.feature_extraction.text import CountVectorizer
cv=CountVectorizer(max_features=5000,stop_words='english')

In [59]:
## And using the object which we created just now 'cv' 
## We are going to apply a method from cv called fit_transform and convert a column called'tags' from a data frame called new_df
## to a array of numbers

vectors=cv.fit_transform(new_df['tags']).toarray()

In [60]:
vectors

array([[0, 0, 0, ..., 0, 0, 0],
       [0, 0, 0, ..., 0, 0, 0],
       [0, 0, 0, ..., 0, 0, 0],
       ...,
       [0, 0, 0, ..., 0, 0, 0],
       [0, 0, 0, ..., 0, 0, 0],
       [0, 0, 0, ..., 0, 0, 0]], dtype=int64)

In [61]:
##👇👇 To know about the stop words which are not going to be included
cv.get_stop_words()

frozenset({'a',
           'about',
           'above',
           'across',
           'after',
           'afterwards',
           'again',
           'against',
           'all',
           'almost',
           'alone',
           'along',
           'already',
           'also',
           'although',
           'always',
           'am',
           'among',
           'amongst',
           'amoungst',
           'amount',
           'an',
           'and',
           'another',
           'any',
           'anyhow',
           'anyone',
           'anything',
           'anyway',
           'anywhere',
           'are',
           'around',
           'as',
           'at',
           'back',
           'be',
           'became',
           'because',
           'become',
           'becomes',
           'becoming',
           'been',
           'before',
           'beforehand',
           'behind',
           'being',
           'below',
           'beside',
           'besides',
           'between',
           'beyond',
           'bill',
           'both',
           'bottom',
           'but',
           'by',
           'call',
           'can',
           'cannot',
           'cant',
           'co',
           'con',
           'could',
           'couldnt',
           'cry',
           'de',
           'describe',
           'detail',
           'do',
           'done',
           'down',
           'due',
           'during',
           'each',
           'eg',
           'eight',
           'either',
           'eleven',
           'else',
           'elsewhere',
           'empty',
           'enough',
           'etc',
           'even',
           'ever',
           'every',
           'everyone',
           'everything',
           'everywhere',
           'except',
           'few',
           'fifteen',
           'fifty',
           'fill',
           'find',
           'fire',
           'first',
           'five',
           'for',
           'former',
           'formerly',
           'forty',
           'found',
           'four',
           'from',
           'front',
           'full',
           'further',
           'get',
           'give',
           'go',
           'had',
           'has',
           'hasnt',
           'have',
           'he',
           'hence',
           'her',
           'here',
           'hereafter',
           'hereby',
           'herein',
           'hereupon',
           'hers',
           'herself',
           'him',
           'himself',
           'his',
           'how',
           'however',
           'hundred',
           'i',
           'ie',
           'if',
           'in',
           'inc',
           'indeed',
           'interest',
           'into',
           'is',
           'it',
           'its',
           'itself',
           'keep',
           'last',
           'latter',
           'latterly',
           'least',
           'less',
           'ltd',
           'made',
           'many',
           'may',
           'me',
           'meanwhile',
           'might',
           'mill',
           'mine',
           'more',
           'moreover',
           'most',
           'mostly',
           'move',
           'much',
           'must',
           'my',
           'myself',
           'name',
           'namely',
           'neither',
           'never',
           'nevertheless',
           'next',
           'nine',
           'no',
           'nobody',
           'none',
           'noone',
           'nor',
           'not',
           'nothing',
           'now',
           'nowhere',
           'of',
           'off',
           'often',
           'on',
           'once',
           'one',
           'only',
           'onto',
           'or',
           'other',
           'others',
           'otherwise',
           'our',
           'ours',
           'ourselves',
           'out',
           'over',
           'own',
           'part',
           'per',
           'perhaps',
           'please',
           'put',
           'rather',
           're',
           'same',
           'see',
           'seem',
           'seemed',
           'seeming',
           'seems',
           'serious',
           'several',
           'she',
           'should',
           'show',
           'side',
           'since',
           'sincere',
           'six',
           'sixty',
           'so',
           'some',
           'somehow',
           'someone',
           'something',
           'sometime',
           'sometimes',
           'somewhere',
           'still',
           'such',
           'system',
           'take',
           'ten',
           'than',
           'that',
           'the',
           'their',
           'them',
           'themselves',
           'then',
           'thence',
           'there',
           'thereafter',
           'thereby',
           'therefore',
           'therein',
           'thereupon',
           'these',
           'they',
           'thick',
           'thin',
           'third',
           'this',
           'those',
           'though',
           'three',
           'through',
           'throughout',
           'thru',
           'thus',
           'to',
           'together',
           'too',
           'top',
           'toward',
           'towards',
           'twelve',
           'twenty',
           'two',
           'un',
           'under',
           'until',
           'up',
           'upon',
           'us',
           'very',
           'via',
           'was',
           'we',
           'well',
           'were',
           'what',
           'whatever',
           'when',
           'whence',
           'whenever',
           'where',
           'whereafter',
           'whereas',
           'whereby',
           'wherein',
           'whereupon',
           'wherever',
           'whether',
           'which',
           'while',
           'whither',
           'who',
           'whoever',
           'whole',
           'whom',
           'whose',
           'why',
           'will',
           'with',
           'within',
           'without',
           'would',
           'yet',
           'you',
           'your',
           'yours',
           'yourself',
           'yourselves'})

In [62]:
## To know about the words which we are considering in our bag of words
cv.get_feature_names_out()

array(['000', '007', '10', ..., 'zone', 'zoo', 'zooeydeschanel'],
      dtype=object)

In [63]:
## 50th word is--abducted
cv.get_feature_names_out()[50]

'500'

In [64]:
cv.get_feature_names_out()[3003]

'monica'

since we have higher dimentionality,so as shown below 
we will be using cosine angle between two movies
-->1.In this the lesser the distance the similar is the movie (ex:0->basically the same;5,10->lesser angle between two movies when they are plotted in a graph of dimentionality(4806,5000)
-->2.The more the angle between them the less is the similarity between them (ex:90,180,...)

& Why did we avoid the regular euclidean rule which as we know goes by ((x2-x1)**2 +(y2-y1)**2)**1/2( PS Distance between two points of two lines)👇
Since it is not a good formula for higher dimentionality 
So,we will be using cosine similarity which is done by calculating the angle between two line i.e two movies which are plotted as lines in a graph in space
👆👆In conclusion we will be calculating cosine distance

In [65]:
new_df.shape

(4806, 3)

In [66]:
vectors.shape

(4806, 5000)

👆 4806 movies,with 5000 most commonly used words in tags(I took 5000 common words we can include our required number of words)

In [67]:
from sklearn.metrics.pairwise import cosine_similarity

In [68]:
similarity=cosine_similarity(vectors)

In [69]:
##to know about each movies similarity and most imp to know about the highest similarity the most basic thing we can do is to 
## SORT the numbers and find out highest similarity
## But by sorting these we may loose our index positions i.e for ex:if the second movie's similarity with the first movies here
## it is 0.08346223 but after sorting 0.04499213,0.01,....other numbers might be in first position
##After sorting we wouldn't know what numbers are which movie's similarity wrt 1st movie 

similarity[0]

array([1.        , 0.08346223, 0.0860309 , ..., 0.04499213, 0.        ,
       0.        ])

In [70]:
## To solve the above problem we use enumerate function
## In this way it won't loose it's index/position  
## By using this it has become from list to list of tuples(can't be altered or messed with)
#list(enumerate(similarity[0]))-->enumerate for fixing indexes
##for sorting from large to small we use sorted() function and also reverse=True
##sorted is for sorting and by default it would sort left section i.e index part so to solve this we use
###key=lambda x:x[1]
####And if we need 5 movies we can use 1:6
sorted(list(enumerate(similarity[0])),reverse=True,key=lambda x:x[1])[1:6]

[(1216, 0.2867696673382022),
 (2409, 0.26901379342448517),
 (3730, 0.2605130246476754),
 (507, 0.255608593705383),
 (539, 0.25038669783359574)]

In [71]:
def recommend(movie):
    movie_index=new_df[new_df['title']==movie].index[0]
    distances=similarity[movie_index]
    movie_list=sorted(list(enumerate(distances)),reverse=True,key=lambda x:x[1])[1:n+1]
    
    for i in movie_list:
        print(new_df.iloc[i[0]].title)

In [72]:
new_df.tail(50)

,movie_id,title,tags
4759,193603,Hayride,a colleg student return home for halloween is ...
4760,84659,The Naked Ape,the nake ape is a coming-of-ag film follow thr...
4761,322745,Counting,an associ collect of visual impress across fif...
4762,20981,The Call of Cthulhu,a die professor leav hi great-nephew a collect...
4763,174362,Bending Steel,"the cyclone, the freakshow, the mermaid parade..."
4764,242095,The Signal,three colleg student on a road trip across the...
4765,250902,The Image Revolution,"twenti year ago, seven superstar artist left m..."
4766,158895,This Is Martin Bonner,"two men, at opposit end of the social spectrum..."
4767,222250,A True Story,"mike and matt own noth and share everything, i..."
4768,18292,George Washington,a delic told and decept simpl stori of a group...
4769,125537,Smiling Fish & Goat On Fire,two brother share a hous in la' fairfax distri...
4770,326576,Dawn of the Crescent Moon,a group of colleg student travel to a small te...
4771,228550,Raymond Did It,mental challeng raymond rourk get blame and fr...
4772,13963,The Last Waltz,martin scorsese' rockumentari intertwin footag...
4773,290391,"Run, Hide, Die",on the anniversari weekend of the death of a y...
4774,44770,The Exploding Girl,"on a summer break from college, ivy, a young e..."
4775,69382,The Legend of God's Gun,a gun-sling preacher return to the debaucher t...
4776,40769,Mutual Appreciation,alan is a musician who leav a busted-up band f...
4777,220490,Her Cry: La Llorona Investigation,"crew of ""paranorm legends"" went to film their ..."
4778,42151,Down Terrace,"after serv jail time for a mysteri crime, bill..."
4779,2292,Clerks,conveni and video store clerk dant and randal ...
4780,42497,Pink Narcissus,an erot poem set in the fantasi of a young mal...
4781,33693,Funny Ha Ha,"unsur of what to do next, 23-year-old marni tr..."
4782,14585,In the Company of Men,"two busi executives--on an avow misogynist, th..."
4783,185465,Manito,"fifteen year ago, their washington height neig..."
4784,38780,Rampage,the boredom of small town life is eat bill wil...
4785,14022,Slacker,"present a day in the life in austin, texa amon..."
4786,366967,Dutch Kills,a desper ex-con is forc to gather hi old crew ...
4787,255266,Dry Spell,sasha tri to get her soon-to-b ex husband kyle...
4788,17345,Flywheel,"jay austin want to sell you a use car, but wat..."
4789,226458,Backmask,"dure an all-night, drug-fuel parti at an aband..."
4790,24055,The Puffy Chair,josh' life is pretti much in the toilet. he' a...
4791,287625,Stories of Our Lives,creat by the member of a nairobi-bas art colle...
4792,44990,Breaking Upwards,"'break upwards' explor a young, real-lif new y..."
4793,86304,All Superheroes Must Die,"mask vigilant charg (jason trost), cutthroat (..."
4794,692,Pink Flamingos,notori baltimor crimin and underground figur d...
4795,39851,Clean,"after lose her husband to a heroin overdose, e..."
4796,13898,The Circle,variou women struggl to function in the oppres...
4797,157185,Tin Can Man,"recent dump by hi girlfirend for anoth man, wo..."
4798,36095,Cure,a wave of gruesom murder is sweep tokyo. the o...
4799,182291,On The Downlow,isaac and angel are two young latino involv in...
4800,286939,Sanctuary: Quite a Conundrum,"it should have been just a normal day of sex, ..."
4801,124606,Bang,a young woman in l.a. is have a bad day: she' ...
4802,14337,Primer,friends/fledgl entrepreneur invent a devic in ...
4803,67238,Cavite,"adam, a secur guard, travel from california to..."
4804,9367,El Mariachi,el mariachi just want to play hi guitar and ca...
4805,72766,Newlyweds,a newlyw couple' honeymoon is upend by the arr...
4806,231617,"Signed, Sealed, Delivered","""signed, sealed, delivered"" introduc a dedic q..."
4807,126186,Shanghai Calling,when ambiti new york attorney sam is sent to s...
4808,25975,My Date with Drew,ever sinc the second grade when he first saw h...

In [73]:
print("Choose a movie from above")
n=int(input("Enter how many similar suggestions you want:"))
print("\n")
print("THESE ARE THE SIMILAR SUGGESTIONS:")
recommend('Tangled')

Choose a movie from above
Enter how many similar suggestions you want:10


THESE ARE THE SIMILAR SUGGESTIONS:
Out of Inferno
The Princess and the Frog
Home on the Range
Animals United
Toy Story 3
Aladdin
Corpse Bride
Monsters vs Aliens
Gulliver's Travels
Despicable Me 2